In [4]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt

In [5]:
# Create a sample dataset
data = {
    'Date': ['2024-07-10', '2024-07-11', '2024-07-12', '2024-07-13', '2024-07-14', '2024-07-15', '2024-07-16'],
    'Product': ['A', 'B', 'A', 'C', 'B', 'A', 'C'],
    'Quantity': [10, 15, 8, 12, 20, 5, 18],
    'Price': [50, 30, 50, 40, 30, 50, 40]
}

In [6]:
dt = pd.DataFrame(data)

In [8]:
dt.head()

         Date Product  Quantity  Price
0  2024-07-10       A        10     50
1  2024-07-11       B        15     30
2  2024-07-12       A         8     50
3  2024-07-13       C        12     40
4  2024-07-14       B        20     30

In [9]:
dt.tail()

         Date Product  Quantity  Price
2  2024-07-12       A         8     50
3  2024-07-13       C        12     40
4  2024-07-14       B        20     30
5  2024-07-15       A         5     50
6  2024-07-16       C        18     40

In [10]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      7 non-null      object
 1   Product   7 non-null      object
 2   Quantity  7 non-null      int64
 3   Price     7 non-null      int64
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [12]:
dt.describe()

        Quantity      Price
count   7.000000   7.000000
mean   12.571429  41.428571
std     5.411628   8.997354
min     5.000000  30.000000
25%     9.000000  35.000000
50%    12.000000  40.000000
75%    16.500000  50.000000
max    20.000000  50.000000

In [22]:
dt['Total_Sales'] = dt['Quantity'] * dt['Price']

In [14]:
dt['Price'].mean()

41.42857142857143

In [16]:
dt['Price'].median()

40.0

In [17]:
dt['Price'].mode()

0    50
Name: Price, dtype: int64

In [23]:
print(dt.groupby('Product')['Total_Sales'].mean())

Product
A    383.333333
B    525.000000
C    600.000000
Name: Total_Sales, dtype: float64